<p style="font-size: 1.1rem; color:#9beb3b; text-align: center; font-family: monospace ">
    <strong><br/><br/>
        PANDAS      
    </strong>
</p>

In [1]:
import pandas as pd

dados = [
    ["Geovana",  "SP", 10000.15],
    ["Fernando", "MG", 7000.45],
    ["Arthur",   "SP", 3000.52],
    ["Alvaro",   "MG", 3000.66],
]
colunas = ["Nome", 'Estado', 'Salário']

df = pd.DataFrame(dados, columns=colunas)

df.head(2)      #5 primeiras e 5 últimas 
df.shape        #Quantidade de linhas e quantidade de colunas
df.info()       #Te mostra a formatação das colunas
df.describe()   #Te mostra p calculo dos numeros resumidos em diversas possibilidades
df.dropna()     #Tira os Vazios (cautela ao usar)
# strip()       #Remove antes ou depois do texto (usar em um loop para)
df.tail(1)      #Mostra a ultima linha
df['Nome']

<class 'pandas.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Nome     4 non-null      str
 1   Estado   4 non-null      str
 2   Salário  4 non-null      float64
dtypes: float64(1), str(2)
memory usage: 228.0 bytes

0     Geovana
1    Fernando
2      Arthur
3      Alvaro
Name: Nome, dtype: str

In [2]:
df.to_excel("dados_bobos.xlsx", index=False)                 #Criar o arquivo no Python 

#pd.read_excel()                                             #Subir o arquivo no Python

In [3]:
cod = 'cod-1015/101215'
p = cod.index('-') + 1
cod[4:]

'1015/101215'

In [4]:
df['Salário'] > 5000

df[df['Salário'] > 5000]

       Nome Estado   Salário
0   Geovana     SP  10000.15
1  Fernando     MG   7000.45

In [5]:
df.groupby('Estado')['Salário'].mean()

display(df.groupby('Estado')['Salário'].mean(),)

Estado
MG    5000.555
SP    6500.335
Name: Salário, dtype: float64

<p style="font-size: 1.1rem; color:#9beb3b; text-align: center; font-family: monospace ">
    <strong><br/><br/>
        EXERCÍCIO 1 — Criando uma tabela de produtos   
    </strong>
</p>

In [6]:
dados = [
    ["COM0001", "COMBUSTIVEL",  "2710.12.59", "L", 200, "Delivery",                         5.69, "SP"],
    ["EST0001", "FILM STRETCH", "3920.10.99", "UN",100, "Operacional",                       37.50, "RJ"],
    ["GAD0001", "CANETA",       "9608.10.00", "UN", 5,  "Administrativo",                     1.50, "SP"],

]
colunas = ["Codigo", 'Descrição', 'NCM', "Tipo", "Quantidade", "Categoria","Valor", "Estado"]
df_exercicio = pd.DataFrame(dados, columns=colunas)

df_exercicio

,Codigo,Descrição,NCM,Tipo,Quantidade,Categoria,Valor,Estado
0,COM0001,COMBUSTIVEL,2710.12.59,L,200,Delivery,5.69,SP
1,EST0001,FILM STRETCH,3920.10.99,UN,100,Operacional,37.50,RJ
2,GAD0001,CANETA,9608.10.00,UN,5,Administrativo,1.50,SP

<p style="font-size: 1.1rem; color:#9beb3b; text-align: center; font-family: monospace ">
    <strong><br/><br/>
        EXERCÍCIO 2 — Visualizando as primeiras linhas
    </strong>
</p>

In [7]:
df_exercicio.head(1)
#df_exercicio.tail(1)

    Codigo    Descrição         NCM Tipo  Quantidade Categoria  Valor Estado
0  COM0001  COMBUSTIVEL  2710.12.59    L         200  Delivery   5.69     SP

<p style="font-size: 1.1rem; color:#9beb3b; text-align: center; font-family: monospace ">
    <strong><br/><br/>
        EXERCÍCIO 3 — Filtrando produtos caros
    </strong>
</p>

In [8]:
df_exercicio[df_exercicio['Valor'] > 30]

df_exercicio.describe()

df_exercicio['Valor'].max()


df_exercicio['Valor_Total'] = df_exercicio['Quantidade'] * df_exercicio['Valor']
df_exercicio


#df_exercicio.groupby('Estado').agg(
    #['Quantidade'].max(),
    #['Valor'].max(),
    #['Valor'].sum()
#)

df_exercicio.groupby('Estado').agg(
    maior_estoque= ('Quantidade', 'max'),
    maior_valor=('Valor', 'max'),
    soma_valor_unitario=('Valor','sum'),
    valor_estoque_total=('Valor_Total', 'sum')
)

        maior_estoque  maior_valor  soma_valor_unitario  valor_estoque_total
Estado
RJ                100        37.50                37.50               3750.0
SP                200         5.69                 7.19               1145.5

<p style="font-size: 1.1rem; color:#9beb3b; text-align: center; font-family: monospace ">
    <strong><br/><br/>
        EXERCÍCIO 4 — Resumo por categoria
    </strong>
</p>

In [9]:
resumo_cat = (
    df_exercicio
      .groupby('Categoria', as_index=True)
      .agg(
          itens            = ('Codigo', 'count'),        # quantidade de SKUs por categoria
          qtd_total        = ('Quantidade', 'sum'),      # soma de quantidades
          preco_medio      = ('Valor', 'mean'),          # preço médio simples
          maior_preco      = ('Valor', 'max'),           # maior preço unitário
          valor_total_cat  = ('Valor_Total', 'sum')      # soma de Quantidade × Valor
      )
      .sort_values('valor_total_cat', ascending=False)
)
resumo_cat

                itens  qtd_total  preco_medio  maior_preco  valor_total_cat
Categoria
Operacional         1        100        37.50        37.50           3750.0
Delivery            1        200         5.69         5.69           1138.0
Administrativo      1          5         1.50         1.50              7.5